Repository: plone/Products.validation
Catalog: Products/validation/locales/*/LC_MESSAGES/plone.po
Languages: fi, hi, uk, zh_cn

source: Id $id is already in use
fi: Tunniste $id on jo käytössä
hi: आईडी $id पहले से ही उपयोग में है
uk: Таке $id вже використовується
zh_cn: Id $id 已经被占用

source: Spaces are not allowed in ids
fi: Välilyönnit eivät ole sallittu tunnisteissa
hi: आईडी में अंतरिक्ष अनुमत नहीं हैं
uk: Пробіли недопустимі в ids
zh_cn: id 里不允许出现空格

source: Validation failed($name): $value of type $type, expected 'string'
fi: Validointi epäonnistui($name): tyypin $type arvo $value, odotettiin merkkijonoa
hi: मान्यीकरण असफल ($name): $value प्रकार $type, 'स्ट्रिंग' की अपेक्षा
uk: Перевірка не вдалася($name): $value типу $type, очікувалось 'стрічка'
zh_cn: ($name) 验证失败：类型 $type 的 $value（值）期望 'string'

source: Validation failed($name): '$value' $errmsg
fi: Validointi epäonnistui($name): '$value' $errmsg
hi: मान्यीकरण असफल ($name): '$value' $errmsg
uk: Помилка перевірки($name): '$value' $errmsg
zh_cn: ($name) 验证失败：'$value' $errmsg

source: Validation failed($name): '$value' is not empty.
fi: Validointi epäonnistui($name): '$value' ei ole tyhjä.
hi: मान्यीकरण असफल ($name): '$value' खाली नहीं है।
uk: Помилка перевірки($name): '$value' не є порожнім.
zh_cn: ($name) 验证失败：'$value' 非空。

source: Validation failed($name): '$value' out of range($min, $max)
fi: Validointi epäonnistui($name): '$value' raja-arvojen ulkopuolella ($min, $max)
hi: मान्यीकरण असफल ($name): '$value' सीमा से बाहर ($min, $max)
uk: Перевірка не вдалася($name): '$value' виходить за межі діапазону($min, $max)
zh_cn: ($name) 验证失败：'$value' 超出范围（$min, $max）

source: Validation failed($name): could not convert $value to a date.
fi: Validointi epäonnistui($name): ei voi kääntää $value päivämääräksi.
hi: मान्यीकरण असफल ($name): $value को तारीख में परिवर्तित नहीं किया जा सका।
uk: Помилка перевірки($name): неможливо перетворити $value на дату.
zh_cn: ($name) 验证失败：不能转换 $value 到日期。

source: Validation failed($name): could not convert '$value' to number
fi: Validointi epäonnistui($name): ei voinut kääntää '$value' numeroksi
hi: मान्यीकरण असफल ($name): '$value' को संख्या में परिवर्तित नहीं किया जा सका
uk: Помилка перевірки($name): неможливо перетворити $value на число.
zh_cn: ($name) 验证失败：不能转换 '$value' 到数字

source: Validation failed($name): value is empty ($value).
fi: Validointi epäonnistui($name): value on tyhjä ($value).
hi: मान्यीकरण असफल ($name): मान खाली है ($value)।
uk: Помилка перевірки($name): '$value' є порожнім.
zh_cn: ($name) 验证失败：($value) 是空的。

source: Validation failed($name: Uploaded data is too large: ${size}MB (max ${max}MB)
fi: Validointi epäonnistui($name): palvelimelle kopioitu tiedosto on liian suuri: ${size}MB (max ${max}MB)
hi: मान्यीकरण असफल ($name: अपलोड किए गए डेटा बहुत बड़ा है: ${size}MB (अधिकतम ${max}MB)
uk: Помилка перевірки($name: Завелика кількість завантажених даних: ${size}MB (max ${max}MB)
zh_cn: 验证失败($name: 上传的数据太大： ${size}MB (最大 ${max}MB)

source: contains unprintable characters
fi: sisältää tulostuskelvottomia merkkejä
hi: अप्रिंटेबल अक्षरों को समाहित करता है
uk: містить символи, які неможливо надрукувати
zh_cn: 包含不可打印的字符

source: is not a decimal number.
fi: ei ole murtoluku.
hi: एक दशमलव संख्या नहीं है।
uk: не є десятковим числом.
zh_cn: 不是10进制数。

source: is not a valid email address.
fi: ei ole kelvollinen sähköpostiosoite.
hi: एक मान्य ईमेल पता नहीं है।
uk: не є дійсною адресою електронної пошти.
zh_cn: 不是有效的 Email 地址。

source: is not a valid international phone number.
fi: ei ole kelvollinen kansainvälinen puhelinnumero.
hi: एक मान्य अंतर्राष्ट्रीय फोन नंबर नहीं है।
uk: не є дійсним міжнародним телефонним номером.
zh_cn: 不是有效的电话号码。

source: is not a valid url.
fi: ei ole kelvollinen url.
hi: एक मान्य यूआरएल नहीं है।
uk: не є дійсним URL.
zh_cn: 不是有效的 url。

source: is not a valid us phone number.
fi: ei ole kelvollinen yhdysvaltojen puhelinnumero.
hi: एक मान्य यूएस फोन नंबर नहीं है।
uk: не є дійсним телефонним номером.
zh_cn: 不是有效的美国电话号码。

source: is not a valid zip code.
fi: ei ole kelvollinen postiosoite.
hi: एक मान्य ज़िप कोड नहीं है।
uk: не є дійсним індексом.
zh_cn: 不是有效的邮政编码。

source: is not a well formed SSN.
fi: ei ole kelvollinen hetu.
hi: एक अच्छी तरह से निर्मित एसएसएन नहीं है।
uk: не є добре сформованим SSN.
zh_cn: 不是有效的SSN。

source: is not an integer.
fi: ei ole kokonaisluku.
hi: एक पूर्णांक नहीं है।
uk: не є цілим числом.
zh_cn: 不是一个整数。

source: this name is not a valid identifier
fi: tämä nimi ei ole kelvollinen tunniste
hi: यह नाम एक वैध पहचानकर्ता नहीं है
uk: це ім'я не є коректним ідентифікатором
zh_cn: 这个名称不是有效的标识符

source: validation failed, expr was:$expr
fi: kelvollisuustarkistus epäonnistui, expr oli:$expr
hi: सत्यापन विफल रहा, expr था:$expr
uk: перевірка невдала, вираз такий:$expr
zh_cn: 验证失败，表达式是：$expr
